## Data Cleaning and Preaparation

In [67]:
import pandas as pd
import numpy as np

In [115]:
city = pd.Series(['ourzazate','rabat','zagora','casa'])

In [116]:
city

0    ourzazate
1        rabat
2       zagora
3         casa
dtype: object

In [117]:
# call isnull function
city.isnull()

0    False
1    False
2    False
3    False
dtype: bool

In [118]:
city[1]=None

In [119]:
city

0    ourzazate
1         None
2       zagora
3         casa
dtype: object

In [120]:
city.isnull()

0    False
1     True
2    False
3    False
dtype: bool

In [121]:
# filtring messing data
data =pd.Series([1.,np.nan,3.,4.,np.nan])
data

0    1.0
1    NaN
2    3.0
3    4.0
4    NaN
dtype: float64

In [77]:
# usnig dropna function
data.dropna()

0    1.0
2    3.0
3    4.0
dtype: float64

In [122]:
# equivalnce of dropna is
data[data.notnull()]

0    1.0
2    3.0
3    4.0
dtype: float64

In [123]:
data = pd.DataFrame([[1.,2.,3.,4.],[np.nan,4.,5.,3.],[np.nan,np.nan,5.,9.],[7.,np.nan,6.,np.nan]])

In [124]:
data

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  4.0  5.0  3.0
2  NaN  NaN  5.0  9.0
3  7.0  NaN  6.0  NaN

In [125]:
cleaned= data.dropna()

In [126]:
cleaned

     0    1    2    3
0  1.0  2.0  3.0  4.0

In [127]:
data.dropna(how='all')

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  4.0  5.0  3.0
2  NaN  NaN  5.0  9.0
3  7.0  NaN  6.0  NaN

In [85]:
data.dropna(axis=1,how='all')

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  4.0  5.0  3.0
2  NaN  NaN  5.0  9.0
3  7.0  NaN  6.0  NaN

In [128]:
# create dataframe with random function
df=pd.DataFrame(np.random.rand(6,4))
df

          0         1         2         3
0  0.789475  0.922849  0.297824  0.492173
1  0.262933  0.577623  0.510121  0.748535
2  0.775420  0.800175  0.224337  0.702209
3  0.576323  0.414750  0.058361  0.360465
4  0.713236  0.151476  0.257118  0.328360
5  0.515763  0.599121  0.782501  0.180370

In [129]:
df.iloc[:2,1]=np.nan
df.iloc[:4,2]=np.nan

In [130]:
df

          0         1         2         3
0  0.789475       NaN       NaN  0.492173
1  0.262933       NaN       NaN  0.748535
2  0.775420  0.800175       NaN  0.702209
3  0.576323  0.414750       NaN  0.360465
4  0.713236  0.151476  0.257118  0.328360
5  0.515763  0.599121  0.782501  0.180370

In [131]:
df.dropna()

          0         1         2        3
4  0.713236  0.151476  0.257118  0.32836
5  0.515763  0.599121  0.782501  0.18037

In [133]:
df.dropna(thresh=3)

          0         1         2         3
2  0.775420  0.800175       NaN  0.702209
3  0.576323  0.414750       NaN  0.360465
4  0.713236  0.151476  0.257118  0.328360
5  0.515763  0.599121  0.782501  0.180370

In [134]:
df

          0         1         2         3
0  0.789475       NaN       NaN  0.492173
1  0.262933       NaN       NaN  0.748535
2  0.775420  0.800175       NaN  0.702209
3  0.576323  0.414750       NaN  0.360465
4  0.713236  0.151476  0.257118  0.328360
5  0.515763  0.599121  0.782501  0.180370

In [135]:
#replace nan value with 0

df.fillna(0)

          0         1         2         3
0  0.789475  0.000000  0.000000  0.492173
1  0.262933  0.000000  0.000000  0.748535
2  0.775420  0.800175  0.000000  0.702209
3  0.576323  0.414750  0.000000  0.360465
4  0.713236  0.151476  0.257118  0.328360
5  0.515763  0.599121  0.782501  0.180370

In [136]:
df.fillna({1:0.5,2:0})

          0         1         2         3
0  0.789475  0.500000  0.000000  0.492173
1  0.262933  0.500000  0.000000  0.748535
2  0.775420  0.800175  0.000000  0.702209
3  0.576323  0.414750  0.000000  0.360465
4  0.713236  0.151476  0.257118  0.328360
5  0.515763  0.599121  0.782501  0.180370

In [137]:
df

          0         1         2         3
0  0.789475       NaN       NaN  0.492173
1  0.262933       NaN       NaN  0.748535
2  0.775420  0.800175       NaN  0.702209
3  0.576323  0.414750       NaN  0.360465
4  0.713236  0.151476  0.257118  0.328360
5  0.515763  0.599121  0.782501  0.180370

In [138]:
df.fillna(method='bfill')

          0         1         2         3
0  0.789475  0.800175  0.257118  0.492173
1  0.262933  0.800175  0.257118  0.748535
2  0.775420  0.800175  0.257118  0.702209
3  0.576323  0.414750  0.257118  0.360465
4  0.713236  0.151476  0.257118  0.328360
5  0.515763  0.599121  0.782501  0.180370

In [139]:
df1=pd.DataFrame(np.random.rand(8,4))
df1

          0         1         2         3
0  0.423741  0.314408  0.180081  0.811614
1  0.626174  0.372275  0.543850  0.413483
2  0.640142  0.172419  0.356268  0.277263
3  0.862493  0.485764  0.706088  0.980081
4  0.889138  0.467077  0.535783  0.615876
5  0.142557  0.114234  0.214890  0.273378
6  0.177099  0.494532  0.613374  0.675549
7  0.311102  0.312245  0.375994  0.419377

In [140]:
df1.iloc[2:,2]=np.nan
df1.iloc[4:,1]=np.nan

In [100]:
df1

          0         1         2         3
0  0.547031  0.404301  0.149096  0.682426
1  0.385133  0.670399  0.304602  0.265433
2  0.084980  0.590101       NaN  0.340709
3  0.935117  0.681826       NaN  0.078072
4  0.942528       NaN       NaN  0.822362
5  0.922900       NaN       NaN  0.855945
6  0.885437       NaN       NaN  0.633055
7  0.928600       NaN       NaN  0.143105

In [141]:
df1.fillna(method='ffill')

          0         1         2         3
0  0.423741  0.314408  0.180081  0.811614
1  0.626174  0.372275  0.543850  0.413483
2  0.640142  0.172419  0.543850  0.277263
3  0.862493  0.485764  0.543850  0.980081
4  0.889138  0.485764  0.543850  0.615876
5  0.142557  0.485764  0.543850  0.273378
6  0.177099  0.485764  0.543850  0.675549
7  0.311102  0.485764  0.543850  0.419377

In [143]:
df1.fillna(method='ffill',limit=3)

          0         1         2         3
0  0.423741  0.314408  0.180081  0.811614
1  0.626174  0.372275  0.543850  0.413483
2  0.640142  0.172419  0.543850  0.277263
3  0.862493  0.485764  0.543850  0.980081
4  0.889138  0.485764  0.543850  0.615876
5  0.142557  0.485764       NaN  0.273378
6  0.177099  0.485764       NaN  0.675549
7  0.311102       NaN       NaN  0.419377

In [145]:
data=pd.Series([1,np.nan,2,np.nan])
data

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [147]:
data.fillna(data.mean())

0    1.0
1    1.5
2    2.0
3    1.5
dtype: float64

In [149]:
1+2

3

In [150]:
3/2

1.5